#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_member.user-sql-sa-role["1"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["2"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["3"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["4"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["5"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["temp"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-integration"
      + role    = "roles/cloudsql.client"
    }

  # google_service_account.user-sql-service-account["1"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-1-proxy-sa"
      + display_name = "sqlproxy service account for integration-1 namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["2"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-2-proxy-sa"
      + display_name = "sqlproxy service account for integration-2 namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["3"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-3-proxy-sa"
      + display_name = "sqlproxy service account for integration-3 namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["4"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-4-proxy-sa"
      + display_name = "sqlproxy service account for integration-4 namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["5"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-5-proxy-sa"
      + display_name = "sqlproxy service account for integration-5 namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["temp"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "integration-temp-proxy-sa"
      + display_name = "sqlproxy service account for integration-temp namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["1"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-integration.svc.id.goog[integration-1/integration-1-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["2"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-integration.svc.id.goog[integration-2/integration-2-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["3"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-integration.svc.id.goog[integration-3/integration-3-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["4"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
        members            = [
            "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["5"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-integration.svc.id.goog[integration-5/integration-5-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["temp"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXUItuw=" -> (known after apply)
      ~ id                 = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-integration.svc.id.goog[integration-4/integration-4-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-integration.svc.id.goog[integration-temp/integration-temp-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-integration/serviceAccounts/proxy-sa@broad-jade-integration.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_key.user-sql-sa-key["1"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["2"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["3"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["4"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["5"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["temp"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

Plan: 24 to add, 0 to change, 6 to destroy.

Warning: Interpolation-only expressions are deprecated

  on integration.tf line 79, in resource "google_dns_managed_zone" "dns_zone":
  79:   count       = "${var.env == var.suffix ? "1" : "0"}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
